// Задание 1

/*В прошлом модуле в юните «Циклы» вы выполняли следующее задание:
Дан массив. Нужно вывести в консоль количество чётных и нечётных элементов в массиве. Если в массиве есть нулевой элемент, то он учитывается и выводится отдельно. 

При выполнении задания необходимо учесть, что массив может содержать не только числа, но и знаки, например null и так далее.

На этот раз оформите решение в виде функции: постарайтесь дать этой функции корректное название, вызовите функцию, проанализируйте синтаксис.
*/


function getArrayInfo(arr) {
  const result = arr.reduce(function (acc, item, index, array) {
    if (!Number.isInteger(item)) { return acc; }
    if (item === 0) { return [ acc[0], acc[1], acc[2] + 1 ]; }
    if (item % 2 === 0) { return [ acc[0] + 1, acc[1], acc[2] ]; }
    if (item % 2 === 1) { return [ acc[0], acc[1] + 1, acc[2]]; }
  }, [0,0,0] );
  return result
}

const arr = [1, 4, 7, 7, '3', null, Infinity, NaN, 0];			//заданный массив
const result = getArrayInfo(arr);

console.log(`четных - ${result[0]}\n нечётных - ${result[1]}\n нулей - ${result[2]}`)